# Radius Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Connector..::..Radius Property
Connector Class See Also
---
The radius of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual double Radius { get; set; }
```

Visual Basic
---
```text
Public Overridable Property Radius As Double
	Get
	Set
```

Visual C++
---
```text
public:
virtual property double Radius {
	double get ();
	void set (double value);
}
```

# ### Implements
IConnector..::..Radius
# Remarks
In order to set this property, it must be mapped to a writable instance parameter in the family definition.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the connector's shape is not round. |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the argument is invalid. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown on failure to set radius. |

# See Also
Connector Class
Autodesk.Revit.DB Namespace